//https://urait.ru/viewer/programmirovanie-na-yazyke-s-prakticheskiy-kurs-438987#page/78
#include <iostream>
#include <iomanip>
#include <cmath>
double eps = 1e-9;
using namespace std;
//Функция задающая значения функции
double f(double x){
    double t = (x*x + 2*x + 1); // переменная для хранения значения используемого в условии
    if (t < 2){
        return x*x;
    }else if (2 <= t && t < 3){
        return 1./(x*x - 1);
    }else if (t >= 3){
        return 0;
    }
}


int main(){
    cout << fixed << setprecision(3); // Выставление фиксированного количества знаков после запятой
    double a, b, h;
    cin >> a >> b >> h; // Ввод переменных
    cout << "   x  |  f(x)" << endl;
    while (a <= (b + eps)){ // Использование переменный eps для устранения проблемы с шумом в данных при использовании типа double
        cout << a << " | " << f(a) << endl;
        a+=h;
    }
    // Тесты:
    // Ввод: -1 1 0.09 ; Ввод 0 1 0.1   ; Ввод -1 0 0.5
    //   x  |  f(x)         x  |  f(x)        x  |  f(x)
    //-1.000 | 1.000     0.000 | 0.000     -1.000 | 1.000
    //-0.910 | 0.828     0.100 | 0.010     -0.500 | 0.250
    //-0.820 | 0.672     0.200 | 0.040     0.000 | 0.000
    //-0.730 | 0.533     0.300 | 0.090
    //-0.640 | 0.410     0.400 | 0.160
    //-0.550 | 0.303     0.500 | -1.333
    //-0.460 | 0.212     0.600 | -1.562
    //-0.370 | 0.137     0.700 | -1.961
    //-0.280 | 0.078     0.800 | 0.000
    //-0.190 | 0.036     0.900 | 0.000
    //-0.100 | 0.010     1.000 | 0.000
    //-0.010 | 0.000
    //0.080 | 0.006
    //0.170 | 0.029
    //0.260 | 0.068
    //0.350 | 0.122
    //0.440 | -1.240
    //0.530 | -1.391
    //0.620 | -1.624
    //0.710 | -2.017
    //0.800 | 0.000
    //0.890 | 0.000
    //0.980 | 0.000
}