#include <iostream>
//9
using namespace std;

//b1 = 0.5 b2 = 0.2 b(n+1) = b^2(n) + b(n-1)/n

int main() {
    double b1 = 0.5, b2 = 0.2,b_n;
    int n = 3, x;
    cout << "Введите n:\n";
    cin >> x;
    if (x == 1){
        cout << b1;
    }else if (x == 2){
        cout << b1 << " " << b2 << " ";
    }else{
    while(n <= x){
        b_n = b2*b2 + (b1 / n);
        b1 = b2;
        b2 = b_n;
        cout << b_n << " ";
        n++;
    }
    }
    // Ввод 5
    // 0.5 0.2 0.206667 0.0927111 0.0499287
    // Ввод 10
    // 0.5 0.2 0.206667 0.0927111 0.0499287 0.0179447 0.00745468 0.00229866 0.000833582 0.000230561
    // Ввод 3
    // 0.5 0.2 0.206667
    // Ввод 1
    // 0.5
    // Ввод 2
    // 0.5 0.2
}
